In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('output.csv')

In [3]:
df

,title,price,area,transaction,furnishing,society,bathroom,balcony,usp_details,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,₹1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,SocietyAdore Presidential World,Bathroom4,Balcony4,NaN,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,₹1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,SocietyAdore Presidential World,Bathroom4,Balcony4,NaN,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",₹1.18 Cr,Super Area3150 sqft,TransactionNew Property,FurnishingUnfurnished,SocietyBPTP Parkland Pride,Bathroom4,Balcony4,NaN,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",₹24 Lac,Super Area337 sqft,TransactionNew Property,FurnishingUnfurnished,SocietyAmolik Sankalp,Bathroom1,Balcony1,NaN,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",₹1.15 Cr,Carpet Area1110 sqft,TransactionNew Property,FurnishingSemi-Furnished,SocietyPuri Amanvilas,Bathroom2,Balcony2,NaN,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",₹1.79 Cr,Super Area2001 sqft,TransactionNew Property,FurnishingUnfurnished,NaN,Bathroom3,NaN,NaN,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,₹1.43 Cr,Super Area1895 sqft,TransactionNew Property,FurnishingUnfurnished,NaN,Bathroom3,NaN,NaN,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",₹1.10 Cr,Super Area1248 sqft,TransactionNew Property,FurnishingUnfurnished,NaN,Bathroom1,NaN,NaN,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",₹47.9 Lac,Super Area1083 sqft,TransactionNew Property,FurnishingUnfurnished,NaN,Bathroom2,NaN,NaN,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",₹2.15 Cr,Super Area1467 sqft,TransactionNew Property,FurnishingUnfurnished,NaN,Bathroom3,NaN,NaN,3,13.023781,80.199446

In [4]:
columns_to_remove = ['usp_details', 'society']  # Replace with the names of the columns you want to remove
df = df.drop(columns=columns_to_remove)

In [5]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,₹1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,₹1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",₹1.18 Cr,Super Area3150 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",₹24 Lac,Super Area337 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",₹1.15 Cr,Carpet Area1110 sqft,TransactionNew Property,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",₹1.79 Cr,Super Area2001 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,₹1.43 Cr,Super Area1895 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",₹1.10 Cr,Super Area1248 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",₹47.9 Lac,Super Area1083 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",₹2.15 Cr,Super Area1467 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446

In [6]:
import pandas as pd
import re

def parse_price(price_str):
    """
    Attempts to convert price strings to a complete numeric value.
    
    Recognized formats:
      - '75L', '75 L', '75 lakh', '75lakh', '75 lac'  -> returns 75 * 100,000 = 7,500,000
      - '1.2Cr', '1.2 Cr', '1.2 crore'                 -> returns 1.2 * 10,000,000 = 12,000,000
      - 'Rs 75L', 'INR 1.2Cr'                          -> similar logic after removing currency symbols
      - If no unit is detected, returns the numeric part as-is.
    
    Unrecognized formats return None.
    """
    if not isinstance(price_str, str):
        return None
    
    # Convert to lowercase for uniformity
    price_str = price_str.lower().strip()
    
    # Remove common currency symbols or words (e.g., 'rs', 'inr')
    price_str = re.sub(r'\b(rs\.?|inr)\b', '', price_str)
    
    # Remove text within parentheses (e.g., "(negotiable)")
    price_str = re.sub(r'\(.*?\)', '', price_str)
    
    # Remove extra words that could interfere (e.g., 'onwards', 'approx')
    price_str = re.sub(r'\b(onwards|approx)\b', '', price_str)
    
    # Remove commas and extra spaces
    price_str = price_str.replace(',', '').strip()
    
    # Use regex to extract the first numeric part and an optional unit word.
    # This matches a number (possibly with commas or a decimal point) and
    # then an optional alphabetic unit.
    match = re.search(r'(\d[\d\.]*)\s*([a-z]+)?', price_str)
    if not match:
        return None

    numeric_part = match.group(1)
    try:
        value = float(numeric_part)
    except ValueError:
        return None

    unit = match.group(2) or ''

    # Check for unit keywords (for lakhs/lacs)
    if 'lakh' in unit or 'lac' in unit or unit == 'l':
        return value * 1e5  # 1 Lakh = 100,000
    # Check for unit keywords for crores
    elif 'cr' in unit or 'crore' in unit:
        return value * 1e7  # 1 Crore = 10,000,000
    else:
        # If no recognizable unit, assume the number is already complete.
        return value

# -------------------------------
# Example usage on your CSV file:
# -------------------------------

# Create a new column 'price_parsed' with the parsed values
df["price_parsed"] = df["price"].apply(parse_price)

# Print the number of rows where the price could not be parsed
print("Number of NaN (unparsed) prices:", df["price_parsed"].isna().sum())

# Save the updated DataFrame to a new CSV file
df.to_csv("output_parsed.csv", index=False)

print("Prices have been parsed and saved to 'output_parsed.csv'.")

Number of NaN (unparsed) prices: 4378
Prices have been parsed and saved to 'output_parsed.csv'.

In [7]:
sdf = pd.read_csv('output_parsed.csv')
sdf

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude,price_parsed
0,4 BHK Flat for Sale in Adore Presidential Wo...,₹1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN,12500000.0
1,4 BHK Flat for Sale in Adore Presidential Wo...,₹1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169,12500000.0
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",₹1.18 Cr,Super Area3150 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623,11800000.0
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",₹24 Lac,Super Area337 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094,2400000.0
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",₹1.15 Cr,Carpet Area1110 sqft,TransactionNew Property,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077,11500000.0
...,...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",₹1.79 Cr,Super Area2001 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220,17900000.0
289524,3 BHK Villa for Sale in Siruseri Chennai,₹1.43 Cr,Super Area1895 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775,14300000.0
289525,"2 BHK Flat for Sale in Paranur, Chennai",₹1.10 Cr,Super Area1248 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890,11000000.0
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",₹47.9 Lac,Super Area1083 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252,4790000.0
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",₹2.15 Cr,Super Area1467 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446,21500000.0

In [8]:
import pandas as pd
import re

def parse_price(price_str):
    """
    Converts price strings like:
      - '₹76.5 Lac', '76.5 lac', '76.5 Lakh', '76.5L'
    into their complete numeric values:
      - For lakhs/lacs: multiply by 100,000
      - For crores: multiply by 10,000,000
    Returns None if the format is not recognized.
    """
    if not isinstance(price_str, str):
        return None

    # Convert to lowercase for uniformity and strip whitespace
    price_str = price_str.lower().strip()

    # Remove common currency symbols and words: remove '₹', 'rs', 'inr'
    price_str = price_str.replace('₹', '')
    price_str = re.sub(r'\b(rs\.?|inr)\b', '', price_str)

    # Remove commas and extra spaces
    price_str = price_str.replace(',', '').strip()
    
    # Remove any text in parentheses (if any)
    price_str = re.sub(r'\(.*?\)', '', price_str).strip()
    
    # Use regex to extract the first numeric part and an optional unit word.
    # It captures numbers like "76.5" and then the unit like "lac", "lakh", "cr", etc.
    match = re.search(r'(\d+(?:\.\d+)?)\s*([a-z]+)?', price_str)
    if not match:
        return None

    numeric_part = match.group(1)
    try:
        value = float(numeric_part)
    except ValueError:
        return None

    unit = match.group(2) or ''

    # Normalize unit spelling
    if unit in ['l', 'lac']:
        unit = 'lakh'
    
    # Multiply based on the unit
    if 'lakh' in unit:
        return value * 1e5  # 1 Lakh = 100,000
    elif 'cr' in unit or 'crore' in unit:
        return value * 1e7  # 1 Crore = 10,000,000
    else:
        # If no recognizable unit, return the numeric value as is.
        return value

# -------------------------------
# Example usage on your CSV file:
# -------------------------------


# Create a new column 'price_parsed' with the parsed values
df["price_parsed"] = df["price"].apply(parse_price)

# Print the number of rows where the price could not be parsed
print("Number of NaN (unparsed) prices:", df["price_parsed"].isna().sum())

# Save the updated DataFrame to a new CSV file
df.to_csv("output_parsed.csv", index=False)
print("Prices have been parsed and saved to 'output_parsed.csv'.")

Number of NaN (unparsed) prices: 4378
Prices have been parsed and saved to 'output_parsed.csv'.

In [9]:
sdf = pd.read_csv('output_parsed.csv')
sdf

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude,price_parsed
0,4 BHK Flat for Sale in Adore Presidential Wo...,₹1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN,12500000.0
1,4 BHK Flat for Sale in Adore Presidential Wo...,₹1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169,12500000.0
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",₹1.18 Cr,Super Area3150 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623,11800000.0
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",₹24 Lac,Super Area337 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094,2400000.0
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",₹1.15 Cr,Carpet Area1110 sqft,TransactionNew Property,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077,11500000.0
...,...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",₹1.79 Cr,Super Area2001 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220,17900000.0
289524,3 BHK Villa for Sale in Siruseri Chennai,₹1.43 Cr,Super Area1895 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775,14300000.0
289525,"2 BHK Flat for Sale in Paranur, Chennai",₹1.10 Cr,Super Area1248 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890,11000000.0
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",₹47.9 Lac,Super Area1083 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252,4790000.0
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",₹2.15 Cr,Super Area1467 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446,21500000.0

In [10]:
df['price']

0          ₹1.25 Cr
1          ₹1.25 Cr
2          ₹1.18 Cr
3           ₹24 Lac
4          ₹1.15 Cr
            ...
289523     ₹1.79 Cr
289524     ₹1.43 Cr
289525     ₹1.10 Cr
289526    ₹47.9 Lac
289527     ₹2.15 Cr
Name: price, Length: 289528, dtype: object

In [11]:
import pandas as pd
import re

def parse_price(price_str):
    """
    Parses price strings by first removing the ₹ symbol and converting values like:
      - '76.5 Lac' or '76.5lakh' -> 7,650,000
      - '1.13 Cr' or '1.13crore' -> 11,300,000
    into their complete numeric values.
    """
    if not isinstance(price_str, str):
        return None

    # Remove the rupee symbol
    price_str = price_str.replace("₹", "")
    
    # Convert to lowercase and strip whitespace
    price_str = price_str.lower().strip()
    
    # Remove common currency words if needed
    price_str = re.sub(r'\b(rs\.?|inr)\b', '', price_str)
    
    # Remove commas and extra spaces
    price_str = price_str.replace(',', '').strip()
    
    # Use regex to extract the numeric value and an optional unit
    match = re.search(r'(\d+(?:\.\d+)?)\s*([a-z]+)?', price_str)
    if not match:
        return None

    numeric_part = match.group(1)
    try:
        value = float(numeric_part)
    except ValueError:
        return None

    unit = match.group(2) or ''
    
    # Normalize unit spelling if necessary
    if unit in ['l', 'lac']:
        unit = 'lakh'
    
    # Convert based on unit
    if 'lakh' in unit:
        return value * 1e5  # 1 Lakh = 100,000
    elif 'cr' in unit or 'crore' in unit:
        return value * 1e7  # 1 Crore = 10,000,000
    else:
        return value

# Read CSV and remove ₹ before applying parsing
df["price"] = df["price"].str.replace("₹", "", regex=False)
df["price_parsed"] = df["price"].apply(parse_price)

print(df[["price", "price_parsed"]].head())

     price  price_parsed
0  1.25 Cr    12500000.0
1  1.25 Cr    12500000.0
2  1.18 Cr    11800000.0
3   24 Lac     2400000.0
4  1.15 Cr    11500000.0

In [12]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude,price_parsed
0,4 BHK Flat for Sale in Adore Presidential Wo...,1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN,12500000.0
1,4 BHK Flat for Sale in Adore Presidential Wo...,1.25 Cr,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169,12500000.0
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",1.18 Cr,Super Area3150 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623,11800000.0
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",24 Lac,Super Area337 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094,2400000.0
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",1.15 Cr,Carpet Area1110 sqft,TransactionNew Property,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077,11500000.0
...,...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",1.79 Cr,Super Area2001 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220,17900000.0
289524,3 BHK Villa for Sale in Siruseri Chennai,1.43 Cr,Super Area1895 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775,14300000.0
289525,"2 BHK Flat for Sale in Paranur, Chennai",1.10 Cr,Super Area1248 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890,11000000.0
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",47.9 Lac,Super Area1083 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252,4790000.0
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",2.15 Cr,Super Area1467 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446,21500000.0

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 289528 entries, 0 to 289527
Data columns (total 11 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   title          289528 non-null  object
 1   price          289527 non-null  object
 2   area           287872 non-null  object
 3   transaction    289182 non-null  object
 4   furnishing     284095 non-null  object
 5   bathroom       286241 non-null  object
 6   balcony        200398 non-null  object
 7   numberOfRooms  278067 non-null  object
 8   latitude       272880 non-null  float64
 9   longitude      272880 non-null  float64
 10  price_parsed   285150 non-null  float64
dtypes: float64(3), object(8)
memory usage: 24.3+ MB

In [14]:
# Replace the 'price' column with the parsed values from 'price_parsed'
df["price"] = df["price_parsed"]

# Optionally, drop the 'price_parsed' column if it's no longer needed
df.drop(columns=["price_parsed"], inplace=True)

# Verify the change
print(df.head())

                                               title       price  \
0  4 BHK Flat  for Sale in  Adore Presidential Wo...  12500000.0
1  4 BHK Flat  for Sale in  Adore Presidential Wo...  12500000.0
2  4 BHK Flat  for Sale in  BPTP Parkland Pride, ...  11800000.0
3  1 BHK Flat  for Sale in  Amolik Sankalp, Secto...   2400000.0
4  3 BHK Flat  for Sale in  Puri Amanvilas, Secto...  11500000.0

                   area              transaction                furnishing  \
0   Super Area2925 sqft  TransactionNew Property     FurnishingUnfurnished
1   Super Area2925 sqft  TransactionNew Property     FurnishingUnfurnished
2   Super Area3150 sqft  TransactionNew Property     FurnishingUnfurnished
3    Super Area337 sqft  TransactionNew Property     FurnishingUnfurnished
4  Carpet Area1110 sqft  TransactionNew Property  FurnishingSemi-Furnished

    bathroom   balcony numberOfRooms   latitude  longitude
0  Bathroom4  Balcony4           NaN        NaN        NaN
1  Bathroom4  Balcony4             4  28.404755  77.370169
2  Bathroom4  Balcony4             4  28.369477  77.371623
3  Bathroom1  Balcony1             1  28.404723  77.356094
4  Bathroom2  Balcony2             3  28.417834  77.367077

In [15]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,Super Area2925 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,Super Area3150 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,Super Area337 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,Carpet Area1110 sqft,TransactionNew Property,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,Super Area2001 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,Super Area1895 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,Super Area1248 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,Super Area1083 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,Super Area1467 sqft,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446

In [16]:
df['area']

0          Super Area2925 sqft
1          Super Area2925 sqft
2          Super Area3150 sqft
3           Super Area337 sqft
4         Carpet Area1110 sqft
                  ...
289523     Super Area2001 sqft
289524     Super Area1895 sqft
289525     Super Area1248 sqft
289526     Super Area1083 sqft
289527     Super Area1467 sqft
Name: area, Length: 289528, dtype: object

In [58]:
import pandas as pd
import re

def extract_area(area_str):
    """
    Extracts the numeric part from a string like 'Super Area1500 sqft'.
    """
    match = re.search(r'(\d+)', area_str)
    if match:
        return int(match.group(1))  # Use int() if you expect whole numbers
    return None

# Assuming df is your DataFrame
df['area'] = df['area'].apply(extract_area)

# Check the first few values
print(df['area'].head())

TypeError: expected string or bytes-like object, got 'float'

In [17]:
import pandas as pd
import re

def extract_area(area_val):
    # If the value is NaN, return None
    if pd.isna(area_val):
        return None
    
    # Convert the value to a string
    s = str(area_val)
    # Search for one or more digits in the string
    match = re.search(r'(\d+)', s)
    if match:
        return int(match.group(1))
    return None

# Assuming df is your DataFrame
df['area'] = df['area'].apply(extract_area)

# Check the first few values
print(df['area'].head())

0    2925.0
1    2925.0
2    3150.0
3     337.0
4    1110.0
Name: area, dtype: float64

In [18]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,TransactionNew Property,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,TransactionNew Property,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,TransactionNew Property,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,TransactionNew Property,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446

In [19]:
df['transaction']

0         TransactionNew Property
1         TransactionNew Property
2         TransactionNew Property
3         TransactionNew Property
4         TransactionNew Property
                   ...
289523    TransactionNew Property
289524    TransactionNew Property
289525    TransactionNew Property
289526    TransactionNew Property
289527    TransactionNew Property
Name: transaction, Length: 289528, dtype: object

In [63]:
def convert_transaction(val):
    # Convert to lowercase and remove extra spaces
    val = val.lower().strip()
    if "new" in val:
        return 1
    elif "resale" in val:
        return 0
    return None  # For unexpected values

df["transaction_numeric"] = df["transaction"].apply(convert_transaction)

AttributeError: 'float' object has no attribute 'lower'

In [20]:
import pandas as pd

def convert_transaction(val):
    # Check if the value is missing or not a string
    if pd.isna(val):
        return None
    # Convert the value to string before processing
    s = str(val).lower().strip()
    if "new" in s:
        return 1
    elif "resale" in s:
        return 0
    else:
        return None  # For unexpected values

# Example usage on your DataFrame
df["transaction_numeric"] = df["transaction"].apply(convert_transaction)
print(df["transaction_numeric"].head())

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
Name: transaction_numeric, dtype: float64

In [21]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude,transaction_numeric
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN,1.0
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169,1.0
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,TransactionNew Property,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623,1.0
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,TransactionNew Property,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094,1.0
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,TransactionNew Property,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077,1.0
...,...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220,1.0
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775,1.0
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,TransactionNew Property,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890,1.0
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,TransactionNew Property,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252,1.0
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,TransactionNew Property,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446,1.0

In [22]:
import pandas as pd

def convert_transaction(val):
    # Check if the value is missing; if so, return None
    if pd.isna(val):
        return None
    # Convert the value to a string and normalize
    s = str(val).lower().strip()
    # Map based on keywords
    if "new" in s:
        return 1
    elif "resale" in s:
        return 0
    else:
        return None  # For any unexpected values

# Assuming df is your DataFrame, apply the conversion and replace the column.
df["transaction"] = df["transaction"].apply(convert_transaction)

# Verify the results
print(df["transaction"].head())

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
Name: transaction, dtype: float64

In [23]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude,transaction_numeric
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1.0,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN,1.0
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1.0,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169,1.0
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,1.0,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623,1.0
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,1.0,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094,1.0
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,1.0,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077,1.0
...,...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,1.0,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220,1.0
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,1.0,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775,1.0
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,1.0,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890,1.0
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,1.0,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252,1.0
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,1.0,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446,1.0

In [24]:
df.drop("transaction_numeric", axis=1, inplace=True)

In [25]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1.0,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1.0,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,1.0,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,1.0,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,1.0,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,1.0,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,1.0,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,1.0,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,1.0,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,1.0,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446

In [26]:
df["transaction"] = df["transaction"].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [27]:
df["transaction"] = df["transaction"].astype("Int64")

In [28]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,1,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,1,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,1,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,1,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,1,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,1,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,1,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,1,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446

In [29]:
df['furnishing']

0            FurnishingUnfurnished
1            FurnishingUnfurnished
2            FurnishingUnfurnished
3            FurnishingUnfurnished
4         FurnishingSemi-Furnished
                    ...
289523       FurnishingUnfurnished
289524       FurnishingUnfurnished
289525       FurnishingUnfurnished
289526       FurnishingUnfurnished
289527       FurnishingUnfurnished
Name: furnishing, Length: 289528, dtype: object

In [30]:
new = df[:]

In [31]:
new

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,FurnishingUnfurnished,Bathroom4,Balcony4,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,1,FurnishingUnfurnished,Bathroom4,Balcony4,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,1,FurnishingUnfurnished,Bathroom1,Balcony1,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,1,FurnishingSemi-Furnished,Bathroom2,Balcony2,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,1,FurnishingUnfurnished,Bathroom3,NaN,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,1,FurnishingUnfurnished,Bathroom3,NaN,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,1,FurnishingUnfurnished,Bathroom1,NaN,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,1,FurnishingUnfurnished,Bathroom2,NaN,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,1,FurnishingUnfurnished,Bathroom3,NaN,3,13.023781,80.199446

In [32]:
df = new[:]

In [33]:
import pandas as pd

# Suppose your DataFrame 'df' is already loaded and contains many columns.
# First, let's inspect the unique values in the 'furnishing' column to ensure our mapping is correct.
print("Before mapping, unique furnishing values:", df["furnishing"].unique())

# Define a mapping dictionary that converts furnishing strings to integers.
furnishing_mapping = {
    "FurnishingUnfurnished": 0,
    "FurnishingSemi-Furnished": 1,
    # If you have other categories, add them here.
    # For example: "FurnishingFully-Furnished": 2,
}

# Apply the mapping only to the 'furnishing' column.
# This will replace the string values with the corresponding numeric codes.
df["furnishing"] = df["furnishing"].map(furnishing_mapping)

# Optionally, convert the column to a nullable integer type (if there are missing values)
df["furnishing"] = df["furnishing"].astype("Int64")

# Verify that only the 'furnishing' column has been modified:
print("After mapping, unique furnishing values:", df["furnishing"].unique())
print(df.head())

Before mapping, unique furnishing values: ['FurnishingUnfurnished' 'FurnishingSemi-Furnished' 'FurnishingFurnished'
 nan]
After mapping, unique furnishing values: <IntegerArray>
[0, 1, <NA>]
Length: 3, dtype: Int64
                                               title       price    area  \
0  4 BHK Flat  for Sale in  Adore Presidential Wo...  12500000.0  2925.0
1  4 BHK Flat  for Sale in  Adore Presidential Wo...  12500000.0  2925.0
2  4 BHK Flat  for Sale in  BPTP Parkland Pride, ...  11800000.0  3150.0
3  1 BHK Flat  for Sale in  Amolik Sankalp, Secto...   2400000.0   337.0
4  3 BHK Flat  for Sale in  Puri Amanvilas, Secto...  11500000.0  1110.0

   transaction  furnishing   bathroom   balcony numberOfRooms   latitude  \
0            1           0  Bathroom4  Balcony4           NaN        NaN
1            1           0  Bathroom4  Balcony4             4  28.404755
2            1           0  Bathroom4  Balcony4             4  28.369477
3            1           0  Bathroom1  Balcony1             1  28.404723
4            1           1  Bathroom2  Balcony2             3  28.417834

   longitude
0        NaN
1  77.370169
2  77.371623
3  77.356094
4  77.367077

In [34]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,0,Bathroom4,Balcony4,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,0,Bathroom4,Balcony4,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,1,0,Bathroom4,Balcony4,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,1,0,Bathroom1,Balcony1,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,1,1,Bathroom2,Balcony2,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,1,0,Bathroom3,NaN,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,1,0,Bathroom3,NaN,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,1,0,Bathroom1,NaN,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,1,0,Bathroom2,NaN,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,1,0,Bathroom3,NaN,3,13.023781,80.199446

In [35]:
df['bathroom']

0         Bathroom4
1         Bathroom4
2         Bathroom4
3         Bathroom1
4         Bathroom2
            ...
289523    Bathroom3
289524    Bathroom3
289525    Bathroom1
289526    Bathroom2
289527    Bathroom3
Name: bathroom, Length: 289528, dtype: object

In [36]:
import pandas as pd

# Using str.extract to get only the numeric part and converting to Int64 (nullable integer)
df["bathroom"] = df["bathroom"].str.extract(r'(\d+)', expand=False).astype("Int64")

# Verify the conversion
print(df["bathroom"].head())
print(df["bathroom"].dtype)

0    4
1    4
2    4
3    1
4    2
Name: bathroom, dtype: Int64
Int64

In [37]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,0,4,Balcony4,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,0,4,Balcony4,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,1,0,4,Balcony4,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,1,0,1,Balcony1,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,1,1,2,Balcony2,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,1,0,3,NaN,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,1,0,3,NaN,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,1,0,1,NaN,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,1,0,2,NaN,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,1,0,3,NaN,3,13.023781,80.199446

In [38]:
df['balcony']

0         Balcony4
1         Balcony4
2         Balcony4
3         Balcony1
4         Balcony2
            ...
289523         NaN
289524         NaN
289525         NaN
289526         NaN
289527         NaN
Name: balcony, Length: 289528, dtype: object

In [39]:
df["balcony"] = df["balcony"].str.extract(r'(\d+)', expand=False).astype("Int64")

In [40]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,0,4,4,NaN,NaN,NaN
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,0,4,4,4,28.404755,77.370169
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,1,0,4,4,4,28.369477,77.371623
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,1,0,1,1,1,28.404723,77.356094
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,1,1,2,2,3,28.417834,77.367077
...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,1,0,3,<NA>,4,13.047710,80.149220
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,1,0,3,<NA>,3,12.821477,80.204775
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,1,0,1,<NA>,2,12.705000,79.974890
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,1,0,2,<NA>,2,12.884633,80.187252
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,1,0,3,<NA>,3,13.023781,80.199446

In [41]:
null_count = df["bathroom"].isna().sum()
print("Number of null values in the 'bathroom' column:", null_count)

Number of null values in the 'bathroom' column: 3288

In [42]:
print("Null values per column:")
print(df.isna().sum())

Null values per column:
title                0
price             4378
area              1656
transaction        391
furnishing       22624
bathroom          3288
balcony          89130
numberOfRooms    11461
latitude         16648
longitude        16648
dtype: int64

In [43]:
#removing the area null values 
#also removing the lat and long null value rows 
df.dropna(subset=['area', 'latitude', 'longitude'], inplace=True)

In [44]:
df.isna().sum()

title                0
price             2644
area                 0
transaction        163
furnishing       19061
bathroom          1632
balcony          84442
numberOfRooms     1007
latitude             0
longitude            0
dtype: int64

In [45]:
import pandas as pd

# Convert 'bathroom' and 'numberOfRooms' to numeric
df['bathroom'] = pd.to_numeric(df['bathroom'], errors='coerce')
df['numberOfRooms'] = pd.to_numeric(df['numberOfRooms'], errors='coerce')

# Create bins for price and area. Adjust the number of bins as needed.
df['price_bin'] = pd.cut(df['price'], bins=10)
df['area_bin']  = pd.cut(df['area'], bins=10)

# Calculate overall medians for fallback
overall_median_bathroom = df['bathroom'].median()
overall_median_rooms = df['numberOfRooms'].median()

# Impute missing 'bathroom' values using the median within each (price_bin, area_bin) group.
df['bathroom'] = df.groupby(['price_bin', 'area_bin'])['bathroom'] \
                   .transform(lambda x: x.fillna(x.median() if pd.notnull(x.median()) else overall_median_bathroom))

# Impute missing 'numberOfRooms' values similarly
df['numberOfRooms'] = df.groupby(['price_bin', 'area_bin'])['numberOfRooms'] \
                        .transform(lambda x: x.fillna(x.median() if pd.notnull(x.median()) else overall_median_rooms))

# (Optional) Convert the imputed columns to a nullable integer type if desired
df['bathroom'] = df['bathroom'].astype('Int64')
df['numberOfRooms'] = df['numberOfRooms'].astype('Int64')

# Drop the helper binning columns if no longer needed
df.drop(columns=['price_bin', 'area_bin'], inplace=True)

# Verify the results:
print("Missing values per column after imputation:")
print(df[['bathroom', 'numberOfRooms']].isna().sum())

C:\Users\ASUS\AppData\Local\Temp\ipykernel_15776\2814916656.py:16: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df['bathroom'] = df.groupby(['price_bin', 'area_bin'])['bathroom'] \
C:\Users\ASUS\AppData\Local\Temp\ipykernel_15776\2814916656.py:20: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df['numberOfRooms'] = df.groupby(['price_bin', 'area_bin'])['numberOfRooms'] \

Missing values per column after imputation:
bathroom         2644
numberOfRooms    2644
dtype: int64

In [46]:
df.isna().sum()

title                0
price             2644
area                 0
transaction        163
furnishing       19061
bathroom          2644
balcony          84442
numberOfRooms     2644
latitude             0
longitude            0
dtype: int64

In [47]:
import pandas as pd

# Convert the relevant columns to numeric
df['bathroom'] = pd.to_numeric(df['bathroom'], errors='coerce')
df['numberOfRooms'] = pd.to_numeric(df['numberOfRooms'], errors='coerce')
df['balcony'] = pd.to_numeric(df['balcony'], errors='coerce')

# Create bins for price and area. Adjust number of bins based on your data.
df['price_bin'] = pd.cut(df['price'], bins=10)
df['area_bin']  = pd.cut(df['area'], bins=10)

# Calculate overall medians as fallback values
overall_median_bathroom = df['bathroom'].median()
overall_median_rooms    = df['numberOfRooms'].median()
overall_median_balcony  = df['balcony'].median()

# Impute missing 'bathroom' values within each (price_bin, area_bin) group.
df['bathroom'] = df.groupby(['price_bin', 'area_bin'])['bathroom'] \
                   .transform(lambda x: x.fillna(x.median() if pd.notnull(x.median()) else overall_median_bathroom))

# Impute missing 'numberOfRooms' values within each (price_bin, area_bin) group.
df['numberOfRooms'] = df.groupby(['price_bin', 'area_bin'])['numberOfRooms'] \
                        .transform(lambda x: x.fillna(x.median() if pd.notnull(x.median()) else overall_median_rooms))

# Impute missing 'balcony' values within each (price_bin, area_bin) group.
df['balcony'] = df.groupby(['price_bin', 'area_bin'])['balcony'] \
                  .transform(lambda x: x.fillna(x.median() if pd.notnull(x.median()) else overall_median_balcony))

# Optionally convert the columns to a nullable integer type (if you want integer values)
df['bathroom'] = df['bathroom'].astype("Int64")
df['numberOfRooms'] = df['numberOfRooms'].astype("Int64")
df['balcony'] = df['balcony'].astype("Int64")

# Drop the helper binning columns
df.drop(columns=['price_bin', 'area_bin'], inplace=True)

# Verify the results:
print("Missing values after imputation:")
print(df[['bathroom', 'numberOfRooms', 'balcony']].isna().sum())

C:\Users\ASUS\AppData\Local\Temp\ipykernel_15776\2557627582.py:18: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df['bathroom'] = df.groupby(['price_bin', 'area_bin'])['bathroom'] \
C:\Users\ASUS\AppData\Local\Temp\ipykernel_15776\2557627582.py:22: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df['numberOfRooms'] = df.groupby(['price_bin', 'area_bin'])['numberOfRooms'] \
C:\Users\ASUS\AppData\Local\Temp\ipykernel_15776\2557627582.py:26: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df['balcony'] = df.groupby(['price_bin', 'area_bin'])['balcony'] \
c:\Users\ASUS\anaconda3\Lib\site-packages\numpy\lib\nanfunctions.py:1215: RuntimeWarning: Mean of empty slice
  return np.nanmean(a, axis, out=out, keepdims=keepdims)

TypeError: Invalid value '7.5' for dtype Int64

In [ ]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude
0,"3 BHK Flat for Sale in Yapral, Hyderabad",7650000.0,1500.0,1,0,3,2,3,17.511748,78.534582
1,"3 BHK Flat for Sale in Kompally, Hyderabad",11300000.0,1485.0,1,0,3,2,3,17.538052,78.483948
2,"4 BHK Flat for Sale in Yapral, Hyderabad",18200000.0,2808.0,1,0,3,2,4,17.515017,78.540123
3,"2 BHK Flat for Sale in Shamshabad, Hyderabad",12700000.0,1590.0,1,0,2,2,2,17.293140,78.414610
4,"4 BHK Flat for Sale in Uppal, NH 2 2, Hyderabad",26300000.0,3330.0,1,0,4,2,4,17.403512,78.549846
...,...,...,...,...,...,...,...,...,...,...
2995,"3 BHK Flat for Sale in Yapral, Hyderabad",15400000.0,1450.0,0,1,3,1,3,17.512838,78.545034
2996,"5 BHK House for Sale in Sachivalaya Colony, V...",35000000.0,4800.0,0,0,7,2,5,17.328104,78.571999
2997,"3 BHK Flat for Sale in Tellapur, Outer Ring ...",14500000.0,2000.0,0,1,3,2,3,17.460620,78.275162
2998,"5 BHK House for Sale in Kukatpally, NH 9 Hyde...",23000000.0,2600.0,0,0,6,3,5,17.493160,78.402277
2999,4 BHK Villa for Sale in Nagaram Hyderabad,16700000.0,2700.0,0,0,4,1,4,17.481821,78.604225

In [ ]:
df.isna().sum()

title              0
price              0
area               0
transaction        4
furnishing       476
bathroom           0
balcony            0
numberOfRooms      0
latitude           0
longitude          0
dtype: int64

In [ ]:


# Fill null values in 'transaction' column with its mode value.
transaction_mode = df['transaction'].mode()[0]
df['transaction'] = df['transaction'].fillna(transaction_mode)

# Fill null values in 'furnishing' column with its mode value.
furnishing_mode = df['furnishing'].mode()[0]
df['furnishing'] = df['furnishing'].fillna(furnishing_mode)

# Verify that the null values have been filled:
print("Missing values after filling mode:")
print(df[['transaction', 'furnishing']].isna().sum())

Missing values after filling mode:
transaction    0
furnishing     0
dtype: int64

In [ ]:
df.isna().sum()

title            0
price            0
area             0
transaction      0
furnishing       0
bathroom         0
balcony          0
numberOfRooms    0
latitude         0
longitude        0
dtype: int64

In [48]:
df

,title,price,area,transaction,furnishing,bathroom,balcony,numberOfRooms,latitude,longitude,price_bin,area_bin
1,4 BHK Flat for Sale in Adore Presidential Wo...,12500000.0,2925.0,1,0,4,4,4,28.404755,77.370169,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"
2,"4 BHK Flat for Sale in BPTP Parkland Pride, ...",11800000.0,3150.0,1,0,4,4,4,28.369477,77.371623,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"
3,"1 BHK Flat for Sale in Amolik Sankalp, Secto...",2400000.0,337.0,1,0,1,1,1,28.404723,77.356094,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"
4,"3 BHK Flat for Sale in Puri Amanvilas, Secto...",11500000.0,1110.0,1,1,2,2,3,28.417834,77.367077,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"
5,"3 BHK Flat for Sale in Bptp District 5, Sect...",9600000.0,1350.0,1,0,2,3,3,28.404755,77.370169,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"
...,...,...,...,...,...,...,...,...,...,...,...,...
289523,"4 BHK Flat for Sale in Porur, Chennai",17900000.0,2001.0,1,0,3,<NA>,4,13.047710,80.149220,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"
289524,3 BHK Villa for Sale in Siruseri Chennai,14300000.0,1895.0,1,0,3,<NA>,3,12.821477,80.204775,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"
289525,"2 BHK Flat for Sale in Paranur, Chennai",11000000.0,1248.0,1,0,1,<NA>,2,12.705000,79.974890,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"
289526,"2 BHK Flat for Sale in Sithalapakkam, Chennai",4790000.0,1083.0,1,0,2,<NA>,2,12.884633,80.187252,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"
289527,"3 BHK Flat for Sale in Ekkatuthangal, Chennai",21500000.0,1467.0,1,0,3,<NA>,3,13.023781,80.199446,"(-9899900.0, 1000090000.0]","(-494.969, 49597.9]"

In [49]:
# Save the DataFrame to a CSV file without the index column
df.to_csv("final_data.csv", index=False)
print("Data saved to final_data.csv")

Data saved to final_data.csv

In [50]:
# Create a new DataFrame with only the latitude and longitude columns
lat_long_df = df[['latitude', 'longitude']].copy()

# Save the new DataFrame to a separate CSV file
lat_long_df.to_csv("lat_long.csv", index=False)

print("Latitude and longitude data saved to 'lat_long.csv'")

Latitude and longitude data saved to 'lat_long.csv'